// Copyright 2022 The Bot Ran Pa Team
//
// This software is licensed under the MIT License. See the LICENSE file at
// the root of the repository for more information.
export default async function suggestMe({ body }) {
  let menu = "";
  let menulist = [
    "เส้นเล็กแห้งต้มยำ",
    "บะหมี่น้ำใส",
    "บะหมี่น้ำตก",
    "บะหมี่เกี๊ยว",
    "บะหมี่แห้ง",
    "บะหมี่ต้มยำ",
    "บะหมี่แห้งต้มยำ",
    "เส้นเล็กน้ำตก",
    "เส้นเล็กต้มยำ",
    "เส้นเล็กแห้ง",
    "เส้นเล็กแห้งต้มยำ",
    "เล็กน้ำตก",
    "หมี่ขาวน้ำใส",
    "หมี่ขาวน้ำตก",
    "หมี่ขาวต้มยำ",
    "หมี่ขาวแห้ง",
    "หมี่ขาวแห้งต้มยำ",
  ];
  menu = menulist[Math.floor(Math.random() * menulist.length)];
  return {
    fulfillmentMessages: [
      {
        text: {
          text: [
            `ลองเอาเป็น${menu}ไหมจ๊ะ`,
            `ลองเอาเป็น${menu}ดูนะ`,
            `ลองเอาเป็น${menu}ดูนะจ๊ะ`,
            `แนะนำเป็น${menu}ดูนะ`,
            `แนะนำเป็น${menu}ดูนะจ๊ะ`,
            `แนะนำเป็น${menu}ไหมจ๊ะ`,
            `แนะนำเป็น${menu}ดีไหมจ๊ะ`,
            `แนะนำเป็น${menu}ดีไหม`,
            `ไม่รู้จะเอาอะไรดี ลองเอาเป็น${menu}ดูนะ`,
            `ไม่รู้จะเอาอะไรดี ลองเอาเป็น${menu}ดูนะจ๊ะ`,
            `ไม่รู้จะเอาอะไรดี ลองเอาเป็น${menu}ไหมจ๊ะ`,
            `ไม่รู้จะเอาอะไรดี ลองเอาเป็น${menu}ดีไหมจ๊ะ`,
            `ไม่รู้จะเอาอะไรดี ลองเอาเป็น${menu}ดีไหม`,
            `ไม่รู้ว่าเคยเอา${menu}มาก่อนไหม`,
            `ไม่รู้ว่าเคยเอา${menu}มาก่อนไหมจ๊ะ`,
            `ไม่รู้ว่าเคยเอา${menu}มาก่อนไหม`,
            `ไม่รู้ว่าเคยเอา${menu}มาก่อนไหมจ๊ะ`,
            // `สามารถสั่งได้เลยจ้ะอยากกินอะไร`,
            `ส่วนมากร้านเราคนสั่งเส้นเล็กเยอะ ป้าว่าน่าจะอร่อยนะ`,
            `หนูลอง${menu}ไหม`,
            `ป้าตามใจหนู`,
            // `หนูสั่งได้เลยลูกอยากกินอะไร`,
            // `แล้วหนูอยากกินอะไรล่ะลูก`,
            // `ลองสั่งอย่างอื่นดูไหมจ๊ะ`,
            `ป้าว่า${menu}อร่อยนะ ลองชิมแล้ว`,
          ]
            .sort(() => Math.random() - 0.5)
            .slice(0, 1),
        },
      },
      // {
      //   "line": {}
      // }
    ],
  };
}
